# # Пользователь вводит произвольную строку, вывести True если строка состоит из цифр, False если нет
# line = str(input('Some line: '))
# print(line.isdigit())

# # Пользователь вводит строку, вывести её в верхнем регистре
# line = str(input('Some line: '))
# print(line.upper())

# # Пользователь вводит строку, вывести её заменив в каждом слове первую букву на верхний регистр
# line = str(input('Some line: '))
# print(line.title())

# # Пользователь вводит строку, удалить из строки все пробелы и вывести
# line = str(input('Some line: '))
# print(line.replace(' ', ''))

# # Пользователь вводит строку, символ1 и символ2.
# # Заменить в строке все символы равные символ1 на символ2.
# # Вывести новую строку
# line = str(input('Some line: '))
# print(line.replace('a', 'b'))

# # Пользователь вводит строку, заменить символы верхнего регистра на нижний и наоборот и вывести новую строку.
# line = str(input('Some line: '))
# some_line = line.swapcase()
# print(some_line)

# # Пользователь вводит строку, удалить из строки все знаки ‘_’ в начале строки и в конце
# line = str(input('Some line: '))
# print(line.strip('_'))

# # Пользователь вводит строку и символ, посчитать количество символов в строке.
# line = input('Some line: ')
# print(line.count('a'))

# # Дан список, добавить элемент в конец списка и удалить первый элемент
# some_list = [1, 2, 3, 5, 7, 5]
# print(some_list)
# some_list.remove(1)
# print(some_list)
